server/app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM "items"

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 4)

  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "created_at", "x", "y", "updated_at") VALUES(NULL, '2011-05-15 19:47:07', NULL, NULL, '2011-05-15 19:47:07')

  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])
---
SELECT * FROM "items" WHERE ("items"."id" = 3)
UPDATE "items" SET "updated_at" = '2011-05-15 20:14:04', "y" = 4, "x" = 3, "name" = 'xcvxcv' WHERE "id" = 4